; ---------------------------------------------------------------------------
; Disabled
; ---------------------------------------------------------------------------

; 無変換
Hotkey, SC07B, Disable
;変換
Hotkey, SC079, Disable
;ひらがな/カタカナ
HotKey, SC070, Disable

; ---------------------------------------------------------------------------
; Label
; ---------------------------------------------------------------------------
Disable:
Return

; ---------------------------------------------------------------------------
; Mapping
; ---------------------------------------------------------------------------
; CapsLock -> Ctrl
CapsLock::Ctrl

; Shift+Space -> DoubleByte Space(Unicode)
+Space::Send, {U+3000}

; 無変換/変換+Space -> Toggle Input mode
SC07B & Space::
SC079 & Space::SC029

; 半角/全角 -> Esc
SC029::Escape

; Script Reload
!r::Reload
